; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph2 - mode
	infrared1 - mode
	infrared0 - mode
	GroundStation2 - direction
	Star0 - direction
	Star1 - direction
	GroundStation4 - direction
	Star3 - direction
	GroundStation5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
	(supports instrument5 infrared1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star3)
	(supports instrument6 infrared0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon7)
)
(:goal (and
	(pointing satellite2 GroundStation5)
	(pointing satellite3 Phenomenon11)
	(have_image Star6 thermograph2)
	(have_image Phenomenon7 thermograph2)
	(have_image Phenomenon8 thermograph2)
	(have_image Star9 thermograph2)
	(have_image Planet10 infrared0)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 thermograph2)
	(have_image Star13 thermograph2)
	(have_image Planet14 infrared1)
	(have_image Planet15 infrared1)
))

)

; plan
1. (turn_to satellite3 star3 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star3)
   goals met: 1 of 12
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 12
3. (calibrate satellite3 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 1 of 12
4. (turn_to satellite3 planet15 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 planet15)
   goals met: 1 of 12
5. (take_image satellite3 planet15 instrument5 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 2 of 12
6. (turn_to satellite3 planet14 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 planet14)
   goals met: 2 of 12
7. (take_image satellite3 planet14 instrument5 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 3 of 12
8. (turn_to satellite3 phenomenon11 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 phenomenon11)
   goals met: 4 of 12
9. (turn_to satellite1 star3 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star3)
   goals met: 4 of 12
10. (take_image satellite3 phenomenon11 instrument5 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 5 of 12
11. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 5 of 12
12. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 5 of 12
13. (turn_to satellite1 phenomenon7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon7)
   goals met: 5 of 12
14. (take_image satellite1 phenomenon7 instrument1 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 6 of 12
15. (turn_to satellite1 phenomenon8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon8)
   goals met: 6 of 12
16. (take_image satellite1 phenomenon8 instrument1 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 7 of 12
17. (turn_to satellite1 planet10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet10)
   goals met: 7 of 12
18. (take_image satellite1 planet10 instrument1 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 8 of 12
19. (turn_to satellite1 star12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star12)
   goals met: 8 of 12
20. (take_image satellite1 star12 instrument1 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 9 of 12
21. (turn_to satellite1 star13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star13)
   goals met: 9 of 12
22. (take_image satellite1 star13 instrument1 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 10 of 12
23. (turn_to satellite1 star6 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star6)
   goals met: 10 of 12
24. (take_image satellite1 star6 instrument1 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 11 of 12
25. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 11 of 12
26. (take_image satellite1 star9 instrument1 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 12 of 12
